---
kind: type
id: T:Autodesk.Revit.DB.Structure.LineLoadType
source: html/b9172085-e7bf-a23f-834c-7a5448ee39d4.htm
---
# Autodesk.Revit.DB.Structure.LineLoadType

LineLoadType class

## Syntax (C#)
```csharp
public class LineLoadType : LoadTypeBase
```